docs/rise_linted.xml

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope">
    <soap:Header>
        <Action xmlns="http://www.w3.org/2005/08/addressing" soap:mustUnderstand="true">
            urn:ihe:iti:2007:ProvideAndRegisterDocumentSet-b

        </Action>
        <MessageID xmlns="http://www.w3.org/2005/08/addressing" soap:mustUnderstand="true">
            urn:uuid:301fab68-7214-41be-be64-2bbd74752594

        </MessageID>
        <To xmlns="http://www.w3.org/2005/08/addressing" soap:mustUnderstand="true">
            https://epa-as-2.dev.epa4all.de:443/VAU/c00aec6beaf4d9ceee10f06af3a0c874b7b907ca8db20ee219cd839b0bdcc0c7/65bb0e53bdbf46699b4c2de681c5e093

        </To>
        <ReplyTo xmlns="http://www.w3.org/2005/08/addressing" soap:mustUnderstand="true">
            <Address>http://www.w3.org/2005/08/addressing/anonymous</Address>
        </ReplyTo>
    </soap:Header>
    <soap:Body>
        <ns5:ProvideAndRegisterDocumentSetRequest xmlns="urn:oasis:names:tc:ebxml-regrep:xsd:rim:3.0" xmlns:ns2="urn:oasis:names:tc:ebxml-regrep:xsd:rs:3.0" xmlns:ns3="urn:oasis:names:tc:ebxml-regrep:xsd:query:3.0" xmlns:ns4="urn:oasis:names:tc:ebxml-regrep:xsd:lcm:3.0" xmlns:ns5="urn:ihe:iti:xds-b:2007" xmlns:ns6="urn:ihe:iti:rmd:2017">
            <ns4:SubmitObjectsRequest>
                <RegistryObjectList>
                    <ExtrinsicObject id="urn:uuid:8f6fb66f-abc2-48e5-bf9b-9ce9186d4cf6" mimeType="text/plain" objectType="urn:uuid:7edca82f-054d-47f2-a032-9b2a5b5186c1">
                        <Slot name="creationTime">
                            <ValueList>
                                <Value>20241127125958</Value>
                            </ValueList>
                        </Slot>
                        <Slot name="languageCode">
                            <ValueList>
                                <Value>de-DE</Value>
                            </ValueList>
                        </Slot>
                        <Slot name="URI">
                            <ValueList>
                                <Value>doc.txt</Value>
                            </ValueList>
                        </Slot>
                        <Name>
                            <LocalizedString value="MyDoc_20241127125958"></LocalizedString>
                        </Name>
                        <Classification classificationScheme="urn:uuid:41a5887f-8865-4c09-adf7-e362475b143a" classifiedObject="urn:uuid:8f6fb66f-abc2-48e5-bf9b-9ce9186d4cf6" id="ID0" nodeRepresentation="DOK" objectType="urn:oasis:names:tc:ebxml-regrep:ObjectType:RegistryObject:Classification">
                            <Slot name="codingScheme">
                                <ValueList>
                                    <Value>1.3.6.1.4.1.19376.3.276.1.5.8</Value>
                                </ValueList>
                            </Slot>
                            <Name>
                                <LocalizedString value="Dokumente ohne besondere Form (Notizen)"></LocalizedString>
                            </Name>
                        </Classification>
                        <Classification classificationScheme="urn:uuid:a09d5840-386c-46f2-b5ad-9c3699a4309d" classifiedObject="urn:uuid:8f6fb66f-abc2-48e5-bf9b-9ce9186d4cf6" id="ID1" nodeRepresentation="urn:ihe:iti:xds:2017:mimeTypeSufficient" objectType="urn:oasis:names:tc:ebxml-regrep:ObjectType:RegistryObject:Classification">
                            <Slot name="codingScheme">
                                <ValueList>
                                    <Value>1.3.6.1.4.1.19376.1.2.3</Value>
                                </ValueList>
                            </Slot>
                            <Name>
                                <LocalizedString value="Format aus MIME Type ableitbar"></LocalizedString>
                            </Name>
                        </Classification>
                        <Classification classificationScheme="urn:uuid:f33fb8ac-18af-42cc-ae0e-ed0b0bdb91e1" classifiedObject="urn:uuid:8f6fb66f-abc2-48e5-bf9b-9ce9186d4cf6" id="ID2" nodeRepresentation="APO" objectType="urn:oasis:names:tc:ebxml-regrep:ObjectType:RegistryObject:Classification">
                            <Slot name="codingScheme">
                                <ValueList>
                                    <Value>1.3.6.1.4.1.19376.3.276.1.5.2</Value>
                                </ValueList>
                            </Slot>
                            <Name>
                                <LocalizedString value="Apotheke"></LocalizedString>
                            </Name>
                        </Classification>
                        <Classification classificationScheme="urn:uuid:f0306f51-975f-434e-a61c-c59651d33983" classifiedObject="urn:uuid:8f6fb66f-abc2-48e5-bf9b-9ce9186d4cf6" id="ID3" nodeRepresentation="ADCH" objectType="urn:oasis:names:tc:ebxml-regrep:ObjectType:RegistryObject:Classification">
                            <Slot name="codingScheme">
                                <ValueList>
                                    <Value>1.3.6.1.4.1.19376.3.276.1.5.9</Value>
                                </ValueList>
                            </Slot>
                            <Name>
                                <LocalizedString value="Administrative Checklisten"></LocalizedString>
                            </Name>
                        </Classification>
                        <Classification classificationScheme="urn:uuid:cccf5598-8b07-4b77-a05e-ae952c785ead" classifiedObject="urn:uuid:8f6fb66f-abc2-48e5-bf9b-9ce9186d4cf6" id="ID4" nodeRepresentation="ANGI" objectType="urn:oasis:names:tc:ebxml-regrep:ObjectType:RegistryObject:Classification">
                            <Slot name="codingScheme">
                                <ValueList>
                                    <Value>1.3.6.1.4.1.19376.3.276.1.5.4</Value>
                                </ValueList>
                            </Slot>
                            <Name>
                                <LocalizedString value="Angiologie"></LocalizedString>
                            </Name>
                        </Classification>
                        <Classification classificationScheme="urn:uuid:93606bcf-9494-43ec-9b4e-a7748d1a838d" classifiedObject="urn:uuid:8f6fb66f-abc2-48e5-bf9b-9ce9186d4cf6" id="ID5" nodeRepresentation="" objectType="urn:oasis:names:tc:ebxml-regrep:ObjectType:RegistryObject:Classification">
                            <Slot name="authorPerson">
                                <ValueList>
                                    <Value>123456789^Muster^Max^^^^^^&amp;1.2.276.0.76.4.16&amp;ISO</Value>
                                </ValueList>
                            </Slot>
                            <Slot name="authorRole">
                                <ValueList>
                                    <Value>11^^^&amp;1.3.6.1.4.1.19376.3.276.1.5.13&amp;ISO</Value>
                                </ValueList>
                            </Slot>
                            <Slot name="authorInstitution">
                                <ValueList>
                                    <Value>Hospital^^^^^&amp;1.2.276.0.76.4.188&amp;ISO^^^^1-SMC-B-Testkarte-883110000141746</Value>
                                </ValueList>
                            </Slot>
                            <Slot name="authorSpecialty">
                                <ValueList>
                                    <Value>071107^^^&amp;1.2.276.0.76.5.514&amp;ISO</Value>
                                </ValueList>
                            </Slot>
                            <Slot name="authorTelecommunication">
                                <ValueList>
                                    <Value>^^Internet^marcus.welby@healthcare.example.org</Value>
                                </ValueList>
                            </Slot>
                        </Classification>
                        <ExternalIdentifier id="ID6" identificationScheme="urn:uuid:2e82c1f6-a085-4c72-9da3-8640a32e42ab" objectType="urn:oasis:names:tc:ebxml-regrep:ObjectType:RegistryObject:ExternalIdentifier" registryObject="urn:uuid:8f6fb66f-abc2-48e5-bf9b-9ce9186d4cf6" value="2.25.218544612647639144539732647414006529606">
                            <Name>
                                <LocalizedString value="XDSDocumentEntry.uniqueId"></LocalizedString>
                            </Name>
                        </ExternalIdentifier>
                        <ExternalIdentifier id="ID7" identificationScheme="urn:uuid:58a6f841-87b3-4a3e-92fd-a8ffeff98427" objectType="urn:oasis:names:tc:ebxml-regrep:ObjectType:RegistryObject:ExternalIdentifier" registryObject="urn:uuid:8f6fb66f-abc2-48e5-bf9b-9ce9186d4cf6" value="A123456780^^^&amp;1.2.276.0.76.4.8&amp;ISO">
                            <Name>
                                <LocalizedString value="XDSDocumentEntry.patientId"></LocalizedString>
                            </Name>
                        </ExternalIdentifier>
                    </ExtrinsicObject>
                    <Association associationType="urn:oasis:names:tc:ebxml-regrep:AssociationType:HasMember" id="ID8" objectType="urn:oasis:names:tc:ebxml-regrep:ObjectType:RegistryObject:Association" sourceObject="urn:uuid:8e50821d-568b-4985-911a-a2c41583d1d6" targetObject="urn:uuid:8f6fb66f-abc2-48e5-bf9b-9ce9186d4cf6">
                        <Slot name="SubmissionSetStatus">
                            <ValueList>
                                <Value>Original</Value>
                            </ValueList>
                        </Slot>
                    </Association>
                    <RegistryPackage id="urn:uuid:8e50821d-568b-4985-911a-a2c41583d1d6">
                        <Slot name="submissionTime">
                            <ValueList>
                                <Value>20241127125958</Value>
                            </ValueList>
                        </Slot>
                        <Classification classificationScheme="urn:uuid:a7058bb9-b4e4-4307-ba5b-e3f0ab85e12d" classifiedObject="urn:uuid:8e50821d-568b-4985-911a-a2c41583d1d6" id="ID9" nodeRepresentation="" objectType="urn:oasis:names:tc:ebxml-regrep:ObjectType:RegistryObject:Classification">
                            <Slot name="authorPerson">
                                <ValueList>
                                    <Value>123456789^Muster^Max^^^^^^&amp;1.2.276.0.76.4.16&amp;ISO</Value>
                                </ValueList>
                            </Slot>
                            <Slot name="authorRole">
                                <ValueList>
                                    <Value>11^^^&amp;1.3.6.1.4.1.19376.3.276.1.5.13&amp;ISO</Value>
                                </ValueList>
                            </Slot>
                            <Slot name="authorInstitution">
                                <ValueList>
                                    <Value>Hospital^^^^^&amp;1.2.276.0.76.4.188&amp;ISO^^^^1-SMC-B-Testkarte-883110000141746</Value>
                                </ValueList>
                            </Slot>
                            <Slot name="authorSpecialty">
                                <ValueList>
                                    <Value>071107^^^&amp;1.2.276.0.76.5.514&amp;ISO</Value>
                                </ValueList>
                            </Slot>
                            <Slot name="authorTelecommunication">
                                <ValueList>
                                    <Value>^^Internet^marcus.welby@healthcare.example.org</Value>
                                </ValueList>
                            </Slot>
                        </Classification>
                        <Classification classificationNode="urn:uuid:a54d6aa5-d40d-43f9-88c5-b4633d873bdd" classifiedObject="urn:uuid:8e50821d-568b-4985-911a-a2c41583d1d6" id="ID12" objectType="urn:oasis:names:tc:ebxml-regrep:ObjectType:RegistryObject:Classification"></Classification>
                        <ExternalIdentifier id="ID10" identificationScheme="urn:uuid:96fdda7c-d067-4183-912e-bf5ee74998a8" objectType="urn:oasis:names:tc:ebxml-regrep:ObjectType:RegistryObject:ExternalIdentifier" registryObject="urn:uuid:8e50821d-568b-4985-911a-a2c41583d1d6" value="2.25.242905966402640478898941144804689786790">
                            <Name>
                                <LocalizedString value="XDSSubmissionSet.uniqueId"></LocalizedString>
                            </Name>
                        </ExternalIdentifier>
                        <ExternalIdentifier id="ID11" identificationScheme="urn:uuid:6b5aea1a-874d-4603-a4bc-96a0a7b38446" objectType="urn:oasis:names:tc:ebxml-regrep:ObjectType:RegistryObject:ExternalIdentifier" registryObject="urn:uuid:8e50821d-568b-4985-911a-a2c41583d1d6" value="A123456780^^^&amp;1.2.276.0.76.4.8&amp;ISO">
                            <Name>
                                <LocalizedString value="XDSSubmissionSet.patientId"></LocalizedString>
                            </Name>
                        </ExternalIdentifier>
                    </RegistryPackage>
                </RegistryObjectList>
            </ns4:SubmitObjectsRequest>
            <ns5:Document id="urn:uuid:8f6fb66f-abc2-48e5-bf9b-9ce9186d4cf6">
                <xop:Include xmlns:xop="http://www.w3.org/2004/08/xop/include" href="cid:630e1e52-2596-449b-9ef4-7b124ad2141b-1@urn%3Aihe%3Aiti%3Axds-b%3A2007"></xop:Include>
            </ns5:Document>
        </ns5:ProvideAndRegisterDocumentSetRequest>
    </soap:Body>
</soap:Envelope>